## Pandas

#### Introduction to Pandas

In [1]:
import pandas as pd

In [6]:
data = pd.DataFrame({'Names': ['Sif', 'Daren', 'Bryan', 'Hector'],
                    'Dpt': ['Analytics', 'Media - SEM', 'Media - AFF', 'Analytics'],
                    'Years': [2, 2, 2, 1],
                    'Title': ['DS', 'MM', 'MM', 'Dr']})
# DataFrame function takes dictionary of keys and values to create a table

In [7]:
data

           Dpt   Names Title  Years
0    Analytics     Sif    DS      2
1  Media - SEM   Daren    MM      2
2  Media - AFF   Bryan    MM      2
3    Analytics  Hector    Dr      1

In [8]:
data.dtypes

Dpt      object
Names    object
Title    object
Years     int64
dtype: object

In [9]:
data.describe()

       Years
count   4.00
mean    1.75
std     0.50
min     1.00
25%     1.75
50%     2.00
75%     2.00
max     2.00

In [13]:
data.columns
## .columns = argument
## .columns() = method

Index(['Dpt', 'Names', 'Title', 'Years'], dtype='object')

In [14]:
data.shape

(4, 4)

In [1]:
import pandas as pd

In [11]:
# Read the data.
data = pd.read_csv('titanic.csv')

In [13]:
# Checking information about the data. DO THIS EVERYTIME
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [18]:
# Rows and Columns
data.shape

(891, 12)

In [19]:
# Size, Rows x Columns
data.size

10692

In [21]:
# Summary Statistics
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [23]:
data.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Frauenthal, Mrs. Henry William (Clara Heinshei...",male,NaN,NaN,NaN,1601,NaN,C23 C25 C27,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [29]:
# Top 5
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [30]:
# Bottom 10
data.tail(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
881,882,0,3,"Markun, Mr. Johann",male,33.0,0,0,349257,7.8958,NaN,S
882,883,0,3,"Dahlberg, Miss. Gerda Ulrika",female,22.0,0,0,7552,10.5167,NaN,S
883,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
884,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [31]:
data.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [34]:
### Slicing and Dicing

data['Name'].head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [35]:
type(data['Name'])

pandas.core.series.Series

In [37]:
type(data)

pandas.core.frame.DataFrame

In [38]:
# List Manipulation 
[1,2,3,5] * 4

[1, 2, 3, 5, 1, 2, 3, 5, 1, 2, 3, 5, 1, 2, 3, 5]

In [39]:
# Series Manipulation
data['Age'].head() * 4

0     88.0
1    152.0
2    104.0
3    140.0
4    140.0
Name: Age, dtype: float64

In [41]:
# this is a vector - becomes a matrix once you add a column
data['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [44]:
## Selecting Multiple ITems
data[ ['Name', 'Age']].head()

                                                Name   Age
0                            Braund, Mr. Owen Harris  22.0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  38.0
2                             Heikkinen, Miss. Laina  26.0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                           Allen, Mr. William Henry  35.0

In [46]:
## Columns.

data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [50]:
## Drop columns 
print(data.columns)

#2 arguments, inplace=True 
data.drop(['PassengerId', 'Parch'], axis=1, inplace=True)

#
print(data.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')
Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

In [56]:
## Drop columns 
print(data.columns)

#2 arguments, inplace=True 
data.drop(['Age'], axis=1)

#
print(data.columns)
data.head()

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')
Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')

,Survived,Pclass,Name,Sex,Age,SibSp,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,373450,8.0500,NaN,S

In [58]:
## Above didn't delete Age because did not use inplace
## The Age attribute still exists but the data does not truly delete
## Drop columns 
print(data.columns)

#2 arguments, inplace=True 
data.drop(['Age'], axis=1, inplace=True)

#
print(data.columns)
data.head()

Index(['Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Ticket', 'Fare',
       'Cabin', 'Embarked'],
      dtype='object')
Index(['Survived', 'Pclass', 'Name', 'Sex', 'SibSp', 'Ticket', 'Fare', 'Cabin',
       'Embarked'],
      dtype='object')

,Survived,Pclass,Name,Sex,SibSp,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,1,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,0,373450,8.0500,NaN,S

In [59]:
## ^Data above is missing Age, PassengerId and Parch

In [61]:
data[:5]

,Survived,Pclass,Name,Sex,SibSp,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,1,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,1,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,1,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,0,373450,8.0500,NaN,S

In [1]:
data.name(1)

NameError: name 'data' is not defined

In [2]:
import pandas as pd
data = pd.read_csv('titanic.csv')

In [35]:
data.loc[[1][2]]

IndexError: list index out of range

In [41]:
data = pd.read_csv("Transaction Inquiries 02052018 (CSV).csv")

In [46]:
data.loc[0]['Order ID']

'6885794618'

In [54]:
data.head()

,Id,Order ID,Resolution,Affiliate,Reason,Amount,Transaction Date,Media Partner,Sale Amount,Submission Date,...,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22
0,170335,6885794618,NaN,,,,2017-12-03T03:00:00-05:00,Ebates .,784.40,2017-12-19T14:58:02-05:00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,170550,6450738992_1,NaN,NaN,NaN,NaN,2017-09-14T03:00:00-04:00,Upromise powered by Affinity Solutions,29.99,2017-12-20T15:28:35-05:00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,173663,6193298295,NaN,NaN,NaN,NaN,2017-12-05T03:00:00-05:00,Clarus Commerce.,58.56,2018-01-03T09:50:24-05:00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,173714,6982874438,NaN,NaN,NaN,NaN,2017-12-19T03:00:00-05:00,Ebates .,308.95,2018-01-03T12:28:56-05:00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,173846,6584260939,NaN,NaN,NaN,NaN,2017-12-31T03:00:00-05:00,Ebates .,156.77,2018-01-04T10:13:00-05:00,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN